<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Writing GNU Emacs Extensions | Hexo</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="Bob Glickstein
O&amp;apos;REILLY



&amp;#x732E;&amp;#x7ED9;&amp;#x6211;&amp;#x7684;&amp;#x7236;&amp;#x6BCD;&amp;#xFF0C; &amp;#x5982;&amp;#x679C;&amp;#x6CA1;&amp;#x6709;&amp;#x4ED6;&amp;#x4EEC;&amp;#x2026;&amp;#x2026;
&amp;#x597D;&amp;#x5427;&amp;#xFF0C;&amp;#x6211;&amp;#x5B81;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="Writing GNU Emacs Extensions">
<meta property="og:url" content="http://yoursite.com/2016/12/12/0/index.html">
<meta property="og:site_name" content="Hexo">
<meta property="og:description" content="Bob Glickstein
O&amp;apos;REILLY



&amp;#x732E;&amp;#x7ED9;&amp;#x6211;&amp;#x7684;&amp;#x7236;&amp;#x6BCD;&amp;#xFF0C; &amp;#x5982;&amp;#x679C;&amp;#x6CA1;&amp;#x6709;&amp;#x4ED6;&amp;#x4EEC;&amp;#x2026;&amp;#x2026;
&amp;#x597D;&amp;#x5427;&amp;#xFF0C;&amp;#x6211;&amp;#x5B81;&amp;#x">
<meta property="og:updated_time" content="2016-12-23T13:02:48.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Writing GNU Emacs Extensions">
<meta name="twitter:description" content="Bob Glickstein
O&amp;apos;REILLY



&amp;#x732E;&amp;#x7ED9;&amp;#x6211;&amp;#x7684;&amp;#x7236;&amp;#x6BCD;&amp;#xFF0C; &amp;#x5982;&amp;#x679C;&amp;#x6CA1;&amp;#x6709;&amp;#x4ED6;&amp;#x4EEC;&amp;#x2026;&amp;#x2026;
&amp;#x597D;&amp;#x5427;&amp;#xFF0C;&amp;#x6211;&amp;#x5B81;&amp;#x">
  
    <link rel="alternate" href="/atom.xml" title="Hexo" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Hexo</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-0" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/12/12/0/" class="article-date">
  <time datetime="2016-12-12T07:54:46.000Z" itemprop="datePublished">2016-12-12</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      Writing GNU Emacs Extensions
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        

<p>
Bob Glickstein<br>
O&apos;REILLY<br>
</p>

<p>
&#x732E;&#x7ED9;&#x6211;&#x7684;&#x7236;&#x6BCD;&#xFF0C; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x4ED6;&#x4EEC;&#x2026;&#x2026;<br>
&#x597D;&#x5427;&#xFF0C;&#x6211;&#x5B81;&#x613F;&#x4E0D;&#x53BB;&#x60F3;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;<br>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> &#x524D;&#x8A00;</h2>
<div class="outline-text-2" id="text-1">
<p>
&#x5728;&#x4F60;&#x80FD;&#x591F;&#x6269;&#x5C55;Emacs&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x529F;&#x80FD;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x4E86;&#x3002;&#x5B83;&#x4E0D;&#x4EC5;&#x80FD;&#x6EE1;&#x8DB3;&#x4F60;&#x5E73;&#x5E38;&#x6240;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x4E00;&#x5207;&#x9700;&#x6C42;&#xFF08;&#x6BB5;&#x843D;&#x6392;&#x7248;&#xFF0C;&#x884C;&#x5C45;&#x4E2D;&#x5BF9;&#x9F50;&#xFF0C;&#x6B63;&#x5219;&#x641C;&#x7D22;&#xFF0C;&#x5C06;&#x4E00;&#x6574;&#x5757;&#x6587;&#x672C;&#x8BBE;&#x7F6E;&#x4E3A;&#x5927;&#x5199;&#xFF09;&#xFF0C;&#x4E0D;&#x4EC5;&#x662F;&#x5B83;&#x5177;&#x6709;&#x5F88;&#x591A;&#x9AD8;&#x7EA7;&#x7684;&#x7279;&#x6027;&#xFF08;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x62EC;&#x53F7;&#x5339;&#x914D;&#x8DF3;&#x8F6C;&#xFF0C;&#x8BED;&#x6CD5;&#x9AD8;&#x4EAE;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x952E;&#x4F4D;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x547D;&#x4EE4;&#x7684;&#x5728;&#x7EBF;&#x5E2E;&#x52A9;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x8FD8;&#x5177;&#x6709;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x4F60;&#x8FDE;&#x505A;&#x68A6;&#x90FD;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x7279;&#x6027;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Emacs&#x6765;&#x9605;&#x8BFB;&#x548C;&#x7F16;&#x5199;email&#x4EE5;&#x53CA;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#xFF1B;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x91CC;&#x9762;&#x4F7F;&#x7528;FTP&#x6765;&#x81EA;&#x7531;&#x7684;&#x7F16;&#x5199;&#x8FDC;&#x7A0B;&#x6587;&#x4EF6;&#xFF1B;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x5B83;&#x63D0;&#x9192;&#x4F60;&#x5373;&#x5C06;&#x5230;&#x6765;&#x7684;&#x4F1A;&#x8BAE;&#x3001;&#x7EA6;&#x4F1A;&#x4EE5;&#x53CA;&#x7EAA;&#x5FF5;&#x65E5;&#x3002;&#x5047;&#x5982;&#x8FD9;&#x8FD8;&#x4E0D;&#x591F;&#x7684;&#x8BDD;&#xFF0C;Emacs&#x8FD8;&#x53EF;&#x4EE5;&#x966A;&#x4F60;&#x73A9;&#x4E94;&#x5B50;&#x68CB;&#xFF08;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x4F1A;&#x8D62;&#xFF09;&#xFF1B;&#x5B83;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#x4ECA;&#x5929;&#x662F;&#x739B;&#x96C5;&#x5386;&#x7684;&#x54EA;&#x4E00;&#x5929;&#xFF1B;&#x5B83;&#x751A;&#x81F3;&#x8FD8;&#x80FD;&#x5206;&#x89E3;&#x8D28;&#x56E0;&#x6570;&#x3002;<br>
</p>

<p>
&#x770B;&#x4E0A;&#x53BB;Emacs&#x7528;&#x6237;&#x82B1;&#x8D39;&#x8FD9;&#x4E48;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x505A;&#x51FA;&#x5982;&#x6B64;&#x591A;&#x79CD;&#x591A;&#x6837;&#x7684;&#x529F;&#x80FD;&#x7B80;&#x76F4;&#x662F;&#x75AF;&#x4E86;&#x3002;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x5C06;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x770B;&#x6210;&#x662F;&#x7F16;&#x5199;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x7684;&#x5DE5;&#x5177;&#xFF1B;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x82B1;&#x8D39;&#x8FD9;&#x4E48;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x6539;&#x53D8;&#x7F16;&#x8F91;&#x5668;&#x672C;&#x8EAB;&#x5462;&#xFF1F;&#x6728;&#x5320;&#x4E0D;&#x4F1A;&#x8017;&#x8D39;&#x7CBE;&#x529B;&#x6539;&#x9020;&#x81EA;&#x5DF1;&#x7684;&#x9524;&#x5B50;&#xFF1B;&#x7BA1;&#x94B3;&#x5DE5;&#x4E0D;&#x4F1A;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#x6539;&#x9020;&#x81EA;&#x5DF1;&#x7684;&#x94B3;&#x5B50;&#xFF1B;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x5B8C;&#x6210;&#x81EA;&#x5DF1;&#x624B;&#x5934;&#x7684;&#x5DE5;&#x4F5C;&#x800C;&#x5DF2;&#x3002;Emacs&#x7528;&#x6237;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4E0D;&#x540C;&#x5462;&#xFF1F;<br>
</p>

<p>
&#x7B54;&#x6848;&#x662F;&#x5982;&#x679C;&#x6728;&#x5320;&#x548C;&#x7BA1;&#x94B3;&#x5DE5;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x5177;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x7528;&#x7684;&#x8BDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x8C01;&#x6BD4;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x66F4;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x5462;&#xFF1F;&#x4F46;&#x4ED6;&#x4EEC;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;&#x5DE5;&#x5177;&#x5236;&#x4F5C;&#x4E13;&#x5BB6;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;Emacs&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x5DE5;&#x5177;&#xFF1A;&#x5B83;&#x662F;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B83;&#x548C;&#x4F7F;&#x7528;&#x5B83;&#x7F16;&#x5199;&#x7684;&#x8F6F;&#x4EF6;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x672C;&#x8D28;&#x4E0A;&#x7684;&#x4E0D;&#x540C;&#x3002;Emacs&#x7684;&#x7528;&#x6237;&#x901A;&#x5E38;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x800C;&#x7F16;&#x5199;Emacs&#x5176;&#x5B9E;&#x4E5F;&#x5C31;&#x662F;&#x7F16;&#x7A0B;&#x3002;Emacs&#x7528;&#x6237;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x5177;&#x4E13;&#x5BB6;&#x3002;<br>
</p>

<p>
&#x8FD9;&#x672C;&#x4E66;&#x5C06;&#x4F7F;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5B9E;&#x4F8B;&#x7531;&#x6D45;&#x5165;&#x6DF1;&#x7684;&#x6559;&#x7ED9;&#x4F60;&#x5982;&#x4F55;&#x7F16;&#x5199;Emacs Lisp&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x5411;Emacs&#x542F;&#x52A8;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x6DFB;&#x52A0;&#x7B80;&#x5355;&#x7684;&#x914D;&#x7F6E;&#x4F5C;&#x4E3A;&#x5F00;&#x59CB;&#xFF0C;&#x5728;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x7740;&#x624B;&#x7F16;&#x5199;&#x201C;&#x4E3B;&#x6A21;&#x5F0F;&#xFF08;major modes&#xFF09;&#x201D;&#x4EE5;&#x53CA;&#x4FEE;&#x6539;Emacs&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x547D;&#x4EE4;&#x5FAA;&#x73AF;(command loop)&#x201D;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5B66;&#x5230;&#x53D8;&#x91CF;&#xFF0C;&#x6309;&#x952E;&#x6620;&#x5C04;&#xFF0C;&#x4EA4;&#x4E92;&#x5F0F;&#x547D;&#x4EE4;&#xFF0C;buffers&#xFF0C;&#x7A97;&#x53E3;&#xFF0C;&#x5904;&#x7406;I/O&#x7B49;&#x3002;&#x672C;&#x4E66;&#x4E2D;&#x6240;&#x63D0;&#x5230;&#x7684;Emacs&#x7279;&#x6307;GNU Emacs&#x3002;&#x6709;&#x8BB8;&#x591A;&#x7F16;&#x8F91;&#x5668;&#x81EA;&#x79F0;&#x4E3A;Emacs&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x6743;&#x5A01;&#x7684;On-line Hacker Jargon File(version 4.0.0, 24-Jul-1996)&#x6240;&#x53D9;&#x8FF0;&#x7684;&#x4E00;&#x70B9;&#x5386;&#x53F2;&#xFF1A;<br>
</p>

<p>
[Emacs] was originally written by Richard Stallman in TECO under ITS at the MIT Al lab; AI Memo<br>
554 described it as &quot;an advanced, self-documenting, customizable, extensible real-time display<br>
editor.&quot; It has since been re-implemented any number of times, by various hackers, and versions exist<br>
that run under most major operating systems. Perhaps the most widely used version, also written by<br>
Stallman and now called &quot;GNU EMACS&quot; or GNUMACS, runs principally under UNIX. It includes<br>
facilities to run compilation subprocesses and send and receive mail; many hackers spend up to 80%<br>
of their tube time inside it. Other variants include GOSMACS, CCA EMACS, UniPress EMACS,<br>
Montgomery EMACS, jove, epsilon, and MicroEMACS.<br>
</p>

<p>
&#x4E66;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x5168;&#x90E8;&#x5728;GNU Emacs 19.34&#x4EE5;&#x53CA;20.1&#x7248;&#x672C;&#x7684;&#x4E00;&#x4E2A;&#x9884;&#x53D1;&#x884C;&#x7248;&#x672C;&#x4E0A;&#x7F16;&#x5199;&#x4EE5;&#x53CA;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x3002;&#x53C2;&#x770B;&#x9644;&#x5F55;D&#xFF0C;&#x83B7;&#x5F97;&#x548C;&#x7F16;&#x8BD1;Emacs&#xFF0C;&#x83B7;&#x53D6;&#x4ECE;&#x54EA;&#x91CC;&#x627E;&#x5230;Emacs&#x7248;&#x672C;&#x7684;&#x4FE1;&#x606F;&#x3002;<br>
</p>

<p>
&#x6211;&#x4EE5;&#x81EA;&#x8EAB;&#x4F7F;&#x7528;Emacs&#x7684;&#x5F00;&#x53D1;&#x7ECF;&#x5386;&#x4F5C;&#x4E3A;&#x4E66;&#x4E2D;&#x793A;&#x4F8B;&#x9009;&#x62E9;&#x7684;&#x6307;&#x5BFC;&#x3002;&#x4E66;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x5B9E;&#x9645;&#x4E0A;&#x8BB2;&#x8FF0;&#x4E86;&#x6211;&#x81EA;&#x5DF1;&#x7684;Emacs&#x7684;&#x4F7F;&#x7528;&#x7ECF;&#x5386;&#x7684;&#x6F14;&#x53D8;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x5728;&#x6700;&#x521D;&#x4F7F;&#x7528;Emacs&#x7684;&#x65F6;&#x5019;&#x5C31;&#x77E5;&#x9053;&#x4E00;&#x5B9A;&#x8981;&#x8BA9;&#x8BE5;&#x6B7B;&#x7684;*BACKSPACE*&#x952E;&#x4E0D;&#x8981;&#x89E6;&#x53D1;&#x5728;&#x7EBF;&#x5E2E;&#x52A9;&#xFF01;&#x4E5F;&#x8BB8;&#x4F60;&#x4E5F;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C06;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x7AE0;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;<br>
</p>

<p>
&#x5728;&#x6211;&#x4F7F;&#x7528;&#x4E86;Emacs&#x4E00;&#x5C0F;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x8BB8;&#x591A;&#x5904;&#x7406;&#x5149;&#x6807;&#x79FB;&#x52A8;&#x7684;&#x5FEB;&#x6377;&#x952E;&#x3002;&#x5C31;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x4F7F;&#x7528;Emacs&#x63D0;&#x4F9B;&#x7684;&#x539F;&#x751F;&#x529F;&#x80FD;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5BF9;&#x5176;&#x5B9A;&#x5236;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x300A;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x65B0;&#x547D;&#x4EE4;&#x300B;&#x4E2D;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8FD9;&#x4E4B;&#x540E;&#x6211;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x907F;&#x514D;&#x6211;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x7684;&#x8F93;&#x5165;&#x9519;&#x8BEF;&#xFF1A;&#x6211;&#x60F3;&#x8981;&#x6309;&#x4E0B;*CONTROL-b*&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5E38;&#x5E38;&#x6309;&#x4E0B;&#x7684;&#x5374;&#x662F;*CONTROL-v*&#x3002;&#x6211;&#x672C;&#x60F3;&#x8BA9;&#x5149;&#x6807;&#x5411;&#x5DE6;&#x79FB;&#x52A8;&#x4E00;&#x70B9;&#xFF0C;&#x5374;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#x4E86;&#x597D;&#x51E0;&#x5C4F;&#x3002;&#x5728;&#x300A;&#x7B2C;&#x4E09;&#x7AE0;&#xFF0C;&#x534F;&#x4F5C;&#x547D;&#x4EE4;&#x300B;&#x4E2D;&#x4F60;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x5F53;&#x6211;&#x5F00;&#x59CB;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x7279;&#x5B9A;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x5904;&#x7406;&#x7279;&#x5B9A;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x300A;&#x7B2C;&#x4E5D;&#x7AE0;&#xFF0C;&#x4E3B;&#x6A21;&#x5F0F;&#x300B;&#x4E2D;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x9664;&#x4E86;&#x6BCF;&#x7AE0;&#x5F00;&#x59CB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x65F6;&#x63D0;&#x51FA;&#x7684;&#x6700;&#x521D;&#x7684;&#x4F8B;&#x5B50;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x522B;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF0C;&#x6BCF;&#x4E2A;&#x4F8B;&#x5B50;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7AE0;&#x8282;&#x3002;&#x6BCF;&#x4E2A;&#x7AE0;&#x8282;&#x90FD;&#x4F1A;&#x63D0;&#x51FA;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x4F7F;&#x7528;Emacs Lisp&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5C55;&#x793A;&#x51FA;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5C31;&#x50CF;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x90FD;&#x8981;&#x53D8;&#x5F97;&#x66F4;&#x5B9E;&#x7528;&#x3001;&#x66F4;&#x901A;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x5728;&#x524D;&#x5F80;&#x4E0B;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x524D;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E00;&#x5230;&#x4E24;&#x6B21;&#x6539;&#x8FDB;&#x3002;<br>
</p>

<p>
&#x6BCF;&#x4E2A;&#x4F8B;&#x5B50;&#x90FD;&#x57FA;&#x4E8E;&#x524D;&#x9762;&#x4F8B;&#x5B50;&#xFF0C;&#x5E76;&#x4E14;&#x5E26;&#x5165;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x65B0;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x672C;&#x4E66;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8986;&#x76D6;&#x5927;&#x90E8;&#x5206;Emacs Lisp&#x7F16;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x5E76;&#x4E14;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5728;&#x7EBF;&#x6587;&#x6863;&#x548C;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x6765;&#x5E2E;&#x4F60;&#x66F4;&#x5FEB;&#x7684;&#x4F7F;&#x7528;Emacs Lisp&#x6765;&#x6EE1;&#x8DB3;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4FD7;&#x8BDD;&#x8BF4;&#x5F97;&#x597D;&#xFF1A;&#x6388;&#x4EBA;&#x4EE5;&#x9C7C;&#x4E0D;&#x5982;&#x6388;&#x4EBA;&#x4EE5;&#x6E14;&#x3002;<br>
</p>

<p>
&#x8FD9;&#x672C;&#x4E66;&#x5047;&#x8BBE;&#x4F60;&#x719F;&#x6089;&#x7F16;&#x7A0B;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x4F7F;&#x7528;Emacs&#x3002;&#x5982;&#x679C;&#x4F60;&#x719F;&#x6089;Lisp&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x8A00;&#xFF08;Emacs Lisp&#x4E5F;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#xFF09;&#x5C06;&#x4F1A;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5FC5;&#x8981;&#x3002;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x7AE0;&#x8282;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;Lisp&#x7F16;&#x7A0B;&#x7684;&#x8981;&#x9886;&#x5C06;&#x4F1A;&#x5F88;&#x5FEB;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x7406;&#x6E05;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x9644;&#x5F55;A&#xFF0C;Lisp&#x5FEB;&#x901F;&#x5BFC;&#x822A;&#xFF0C;&#x5B83;&#x7B80;&#x8981;&#x7684;&#x63CF;&#x8FF0;&#x4E86;Lisp&#x7684;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x3002;<br>
</p>

<p>
&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x719F;&#x6089;Emacs&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB;Debra Cameron&#xFF0C;Bill Rosenblatt&#xFF0C; &#x548C; Eric Raymond&#x6240;&#x5199;&#x7684;&#x300A;Learning GNU Emacs, 2nd edition&#x300B;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Emacs&#x81EA;&#x5E26;&#x7684;&#x5728;&#x7EBF;&#x5E2E;&#x52A9;&#xFF0C;&#x7279;&#x522B;&#x662F;info&#x624B;&#x518C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x300A;The GNU Emacs Manual&#x300B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x66F4;&#x5168;&#x9762;&#x7684;&#x7406;&#x89E3;Lisp&#x7F16;&#x7A0B;&#xFF0C;&#x6211;&#x63A8;&#x8350;&#x9605;&#x8BFB;David Touretzky&#x7684;&#x300A;Common Lisp: A Gentle Introduction to Symbolic Computation&#x300B;&#x3002;<br>
</p>

<p>
&#x672C;&#x4E66;&#x4E0D;&#x662F;Emacs Lisp&#x7684;&#x53C2;&#x8003;&#x624B;&#x518C;&#xFF1B;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x6DF1;&#x5165;&#x7684;&#x8BB2;&#x89E3;&#x8BED;&#x8A00;&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x4E3B;&#x9898;&#x7684;&#x9009;&#x62E9;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x66F4;&#x6709;&#x6559;&#x5B66;&#x610F;&#x4E49;&#x800C;&#x4E0D;&#x662F;&#x6DB5;&#x76D6;&#x6240;&#x6709;&#x8303;&#x7574;&#x3002;&#x5728;&#x9605;&#x8BFB;&#x65F6;&#x6700;&#x597D;&#x4EE5;&#x4ECE;&#x524D;&#x5F80;&#x540E;&#x7684;&#x987A;&#x5E8F;&#x9605;&#x8BFB;&#x4EE5;&#x5F97;&#x5230;&#x6700;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;Free Software Foundation&#x53D1;&#x5E03;&#x7684;&#x300A;The GNU Emacs Lisp Reference Manual&#x300B;&#x662F;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6743;&#x5A01;&#x3002;&#x5B83;&#x6709;&#x591A;&#x79CD;&#x5370;&#x5237;&#x672C;&#x548C;&#x7535;&#x5B50;&#x7248;&#xFF1B;&#x8BE6;&#x60C5;&#x53C2;&#x89C1;&#x9644;&#x5F55;D&#x3002;<br>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> &#x4EC0;&#x4E48;&#x662F;Emacs&#xFF1F;</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x8BA4;&#x4E3A;Emacs&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x662F;&#x5B8C;&#x5168;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x540C;&#x6837;&#x7684;&#x8BF4;&#x5B83;&#x662F;C&#x8BED;&#x8A00;&#x7F16;&#x8F91;&#x5668;&#x4E5F;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#x3002;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x8F83;&#x771F;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x7F16;&#x5199;C&#x8BED;&#x8A00;&#x548C;&#x7F16;&#x5199;&#x6587;&#x672C;&#x662F;&#x4E24;&#x79CD;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;Emacs&#x901A;&#x8FC7;&#x53D8;&#x6210;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x6765;&#x5305;&#x5BB9;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x3002;&#x5F53;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x5173;&#x5FC3;&#x6BB5;&#x843D;&#x7ED3;&#x6784;&#x3002;&#x5F53;&#x7F16;&#x5199;&#x6587;&#x672C;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x5173;&#x5FC3;&#x81EA;&#x52A8;&#x7F29;&#x8FDB;&#x3002;<br>
</p>

<p>
Emacs&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;Lisp&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x5B83;&#x4E5F;&#x662F;16&#x8FDB;&#x5236;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5927;&#x7EB2;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x76EE;&#x5F55;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;email&#x7684;&#x7F16;&#x8F91;&#x5668;&#x7B49;&#x7B49;&#x3002;&#x6BCF;&#x4E00;&#x79CD;&#x7F16;&#x8F91;&#x5668;&#x90FD;&#x662F;&#x4E00;&#x79CD;Emacs&#x7684;&#x6A21;&#x5F0F;&#xFF08;mode&#xFF09;&#xFF0C;&#x5373;&#x4E00;&#x7CFB;&#x5217;&#x5C06;Emacs&#x7684;&#x539F;&#x751F;&#x8981;&#x7D20;&#x548C;&#x884C;&#x4E3A;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x4EE5;&#x5B9E;&#x73B0;&#x65B0;&#x7279;&#x6027;&#x7684;Lisp&#x4EE3;&#x7801;&#x3002;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x6A21;&#x5F0F;&#x4E5F;&#x5C31;&#x662F;Emacs&#x7684;&#x4E00;&#x79CD;&#x6269;&#x5C55;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x4F60;&#x628A;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x90FD;&#x9664;&#x6389;&#x7684;&#x8BDD;&#x2013;&#x5220;&#x6389;&#x6240;&#x6709;&#x6269;&#x5C55;&#x5E76;&#x4E14;&#x53EA;&#x5269;&#x4E0B;Emacs&#x7684;&#x6838;&#x5FC3;&#x2013;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x4E86;&#x4EFB;&#x4F55;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF1B;&#x4F60;&#x53EA;&#x5269;&#x4E0B;&#x5236;&#x4F5C;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x539F;&#x6750;&#x6599;&#x3002;&#x4F60;&#x53EA;&#x5269;&#x4E0B;&#x4E86;&#x7F16;&#x8F91;&#x5668;&#x751F;&#x6210;&#x5668;&#xFF08;editor-builder&#xFF09;&#x3002;<br>
</p>

<p>
&#x4F60;&#x80FD;&#x7528;&#x7F16;&#x8F91;&#x5668;&#x751F;&#x6210;&#x5668;&#x751F;&#x6210;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5F53;&#x7136;&#x662F;&#x7F16;&#x8F91;&#x5668;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4EC0;&#x4E48;&#x662F;&#x7F16;&#x8F91;&#x5668;&#x5462;&#xFF1F;&#x7F16;&#x8F91;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5C55;&#x793A;&#x548C;&#x4FEE;&#x6539;&#x67D0;&#x79CD;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x7528;&#x6765;&#x5E2E;&#x52A9;&#x4E0E;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x66F4;&#x53CB;&#x597D;&#x7684;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5F53;&#x7F16;&#x8F91;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x89C4;&#x5219;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x6BCF;&#x4E2A;&#x53EF;&#x89C1;&#x5B57;&#x7B26;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x5C55;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x6362;&#x884C;&#x7B26;&#x6267;&#x884C;&#x6362;&#x884C;&#xFF1B;&#x4E00;&#x4E2A;&#x5149;&#x6807;&#x7528;&#x6765;&#x8868;&#x793A;&#x7528;&#x6237;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x5C06;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x6570;&#x636E;&#x7684;&#x4EC0;&#x4E48;&#x4F4D;&#x7F6E;&#x3002;&#x5F53;&#x7F16;&#x8F91;&#x76EE;&#x5F55;&#x65F6;&#x5C31;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x76F4;&#x89C2;&#x4E86;&#x2013;&#x8DEF;&#x5F84;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x5148;&#x8F6C;&#x6362;&#x6210;&#x53EF;&#x8BFB;&#x7684;&#x683C;&#x5F0F;&#x2013;&#x6700;&#x7EC8;&#x7684;&#x4EA4;&#x4E92;&#x6D41;&#x7A0B;&#x8981;&#x770B;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x4EBA;&#x6027;&#x5316;&#x3002;<br>
</p>

<p>
&#x8FD9;&#x4E2A;&#x5173;&#x4E8E;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x5B9A;&#x4E49;&#x51E0;&#x4E4E;&#x6DB5;&#x76D6;&#x4E86;&#x6240;&#x6709;&#x4EA4;&#x4E92;&#x7A0B;&#x5E8F;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x800C;&#x8FD9;&#x7EDD;&#x975E;&#x5076;&#x7136;&#x3002;&#x4EA4;&#x4E92;&#x7A0B;&#x5E8F;&#x603B;&#x662F;&#x7528;&#x6765;&#x5904;&#x7406;&#x67D0;&#x79CD;&#x6570;&#x636E;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;Emacs&#x5728;&#x5E7F;&#x4E49;&#x4E0A;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x4EA4;&#x4E92;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x6210;&#x5668;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;UI&#x5DE5;&#x5177;&#x5305;&#xFF01;&#x5C31;&#x50CF;&#x5F88;&#x591A;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x5305;&#x4E00;&#x6837;&#xFF0C;Emacs&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;UI&#x7EC4;&#x4EF6;&#xFF0C;&#x4E00;&#x5957;&#x64CD;&#x4F5C;&#x5B83;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#xFF0C;&#x4E00;&#x5957;&#x6210;&#x719F;&#x7684;I/O&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x79CD;&#x7528;&#x6765;&#x628A;&#x5B83;&#x4EEC;&#x6574;&#x5408;&#x8D77;&#x6765;&#x7684;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x3002;UI&#x7EC4;&#x4EF6;&#x770B;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x4E0D;&#x5982;X11&#xFF0C;Windows&#x6216;&#x8005;Macintosh&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x90A3;&#x6837;&#x6F02;&#x4EAE;&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x50CF;Emacs&#x7A0B;&#x5E8F;&#x5458;&#x6240;&#x53D1;&#x73B0;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x8D85;&#x7EA7;&#x6F02;&#x4EAE;&#x7684;&#x56FE;&#x5F62;&#x5DE5;&#x5177;&#x96C6;&#x5F80;&#x5F80;&#x662F;&#x591A;&#x4F59;&#x7684;&#x3002;99%&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x7684;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x6570;&#x5B57;&#x5217;&#x8868;&#xFF0C;&#x83DC;&#x5355;&#x9879;&#xFF0C;&#x6216;&#x8005;&#x586B;&#x5B57;&#x6E38;&#x620F;&#x91CC;&#x7684;&#x5355;&#x8BCD;&#xFF08;&#x53C2;&#x770B;&#x300A;&#x7B2C;&#x5341;&#x7AE0;&#xFF0C;&#x4E00;&#x4E2A;&#x7EFC;&#x5408;&#x793A;&#x4F8B;&#x300B;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#xFF0C;Emacs&#x5728;&#x529F;&#x80FD;&#x6027;&#x3001;&#x7CBE;&#x5DE7;&#x6027;&#x3001;&#x7B80;&#x5355;&#x6027;&#x4EE5;&#x53CA;&#x6027;&#x80FD;&#x4E0A;&#x90FD;&#x8981;&#x4F18;&#x4E8E;&#x5176;&#x4ED6;&#x3002;<br>
</p>

<p>
&#x201C;&#x4E3A;&#x4EC0;&#x4E48;Emacs&#x7528;&#x6237;&#x4E0D;&#x540C;&#xFF1F;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x771F;&#x6B63;&#x7B54;&#x6848;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4ED6;&#x4EEC;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x5728;&#x6539;&#x9020;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x4E0A;&#x3002;&#x4ED6;&#x4EEC;&#x5728;&#x4F7F;&#x7528;Emacs&#x6765;&#x8FBE;&#x5230;&#x81EA;&#x5DF1;&#x6240;&#x671F;&#x671B;&#x7684;&#x76EE;&#x7684;&#xFF1A;&#x521B;&#x9020;&#x51FA;&#x65E0;&#x7A77;&#x65E0;&#x5C3D;&#x7684;&#x65B0;&#x5DE5;&#x5177;&#xFF08;a universe of new tools&#xFF09;&#x3002;<br>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> &#x672C;&#x4E66;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;</h2>
<div class="outline-text-2" id="text-3">
<p>
&#x4E66;&#x4E2D;&#x7684;&#x6BCF;&#x7AE0;&#x90FD;&#x57FA;&#x4E8E;&#x524D;&#x4E00;&#x7AE0;&#x3002;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x4ECE;&#x524D;&#x5F80;&#x540E;&#x987A;&#x5E8F;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#xFF1B;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x91CC;&#x9762;&#x7684;&#x6240;&#x6709;&#x5B89;&#x6392;&#x5C31;&#x90FD;&#x53D8;&#x5F97;&#x6709;&#x610F;&#x4E49;&#x4E86;&#x3002;<br>
</p>
<ul class="org-ul">
<li>&#x7B2C;1&#x7AE0;&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;Emacs<br>
&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;Emacs&#x505A;&#x51FA;&#x7684;&#x57FA;&#x672C;&#x66F4;&#x6539;&#x3002;&#x8FD9;&#x4E5F;&#x4F1A;&#x4F7F;&#x4F60;&#x719F;&#x6089;Emacs Lisp&#xFF0C;&#x5982;&#x4F55;&#x8BA1;&#x7B97;Lisp&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x90A3;&#x4F1A;&#x5982;&#x4F55;&#x6539;&#x53D8;Emacs&#x7684;&#x884C;&#x4E3A;&#x3002;<br>
</li>
<li>&#x7B2C;2&#x7AE0;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x65B0;&#x547D;&#x4EE4;<br>
&#x6559;&#x7ED9;&#x4F60;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x548C;&#x5B89;&#x88C5;Lisp&#x51FD;&#x6570;&#x6765;&#x4F7F;&#x5176;&#x6B63;&#x786E;&#x7684;&#x6267;&#x884C;&#x3002;&#x94A9;&#x5B50;&#x548C;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x4FEE;&#x9970;&#xFF08;advice&#xFF09;&#x7684;&#x7279;&#x6027;&#x5C06;&#x4F1A;&#x88AB;&#x5F15;&#x5165;&#x3002;<br>
</li>
<li>&#x7B2C;3&#x7AE0;&#xFF0C;&#x534F;&#x4F5C;&#x547D;&#x4EE4;<br>
&#x6559;&#x6388;&#x5982;&#x4F55;&#x5728;&#x4E0D;&#x540C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x95F4;&#x4FDD;&#x5B58;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x4F7F;&#x591A;&#x7EC4;&#x51FD;&#x6570;&#x5171;&#x540C;&#x5DE5;&#x4F5C;&#x2013;&#x7F16;&#x5199;&#x7CFB;&#x7EDF;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x547D;&#x4EE4;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x7B26;&#x53F7;&#x5C5E;&#x6027;&#x548C;&#x6807;&#x8BB0;&#x5C06;&#x4F1A;&#x5728;&#x8FD9;&#x4E2D;&#x95F4;&#x88AB;&#x4ECB;&#x7ECD;&#x3002;<br>
</li>
<li>&#x7B2C;4&#x7AE0;&#xFF0C;&#x641C;&#x7D22;&#x548C;&#x4FEE;&#x6539;Buffers<br>
&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x4F60;&#x6781;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x7684;&#x6280;&#x672F;&#xFF1A;&#x7528;&#x6765;&#x6539;&#x53D8;&#x5F53;&#x524D;buffer&#x548C;&#x5176;&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x4F1A;&#x88AB;&#x4ECB;&#x7ECD;&#x3002;<br>
</li>
<li>&#x7B2C;5&#x7AE0;&#xFF0C;Lisp&#x6587;&#x4EF6;<br>
&#x8BA8;&#x8BBA;&#x52A0;&#x8F7D;&#x3001;&#x81EA;&#x52A8;&#x52A0;&#x8F7D;&#x4EE5;&#x53CA;&#x5305;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4F1A;&#x5728;&#x4F60;&#x521B;&#x5EFA;&#x5927;&#x91CF;&#x76F8;&#x5173;&#x51FD;&#x6570;&#x65F6;&#x7528;&#x5230;&#x3002;<br>
</li>
<li>&#x7B2C;6&#x7AE0;&#xFF0C;List<br>
&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;Lisp&#x91CD;&#x8981;&#x7279;&#x6027;&#x7684;&#x80CC;&#x666F;&#x77E5;&#x8BC6;&#x3002;<br>
</li>
<li>&#x7B2C;7&#x7AE0;&#xFF0C;&#x5B50;&#x6A21;&#x5F0F;<br>
&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5C06;&#x76F8;&#x5173;&#x51FD;&#x6570;&#x548C;&#x53D8;&#x91CF;&#x7EC4;&#x88C5;&#x8FDB;&#x79F0;&#x4E3A;&#x201C;&#x5B50;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x5305;&#x91CC;&#x3002;&#x8FD9;&#x4E2A;&#x7AE0;&#x8282;&#x4E2D;&#x7684;&#x6838;&#x5FC3;&#x4F8B;&#x5B50;&#x662F;&#x4F7F;Emacs&#x4E2D;&#x7684;&#x6BB5;&#x843D;&#x683C;&#x5F0F;&#x5316;&#x5DE5;&#x4F5C;&#x7684;&#x66F4;&#x50CF;&#x6587;&#x672C;&#x5904;&#x7406;&#x8F6F;&#x4EF6;&#x3002;<br>
</li>
<li>&#x7B2C;8&#x7AE0;&#xFF0C;&#x8BA1;&#x7B97;&#x548C;&#x7EA0;&#x9519;<br>
&#x5C55;&#x793A;Emacs Lisp&#x89E3;&#x91CA;&#x5668;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5982;&#x4F55;&#x63A7;&#x5236;&#x5728;&#x4F55;&#x65F6;&#x8BA1;&#x7B97;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x4E0D;&#x53D7;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x5F71;&#x54CD;&#x7684;&#x4EE3;&#x7801;&#x3002;<br>
</li>
<li>&#x7B2C;9&#x7AE0;&#xFF0C;&#x4E3B;&#x6A21;&#x5F0F;<br>
&#x89E3;&#x91CA;&#x5B50;&#x3001;&#x4E3B;&#x6A21;&#x5F0F;&#x95F4;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x540E;&#x8005;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x4E00;&#x4E2A;&#x4EE5;&#x66F4;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x884C;&#x4E3A;&#x5904;&#x7406;&#x4EF7;&#x683C;&#x6587;&#x4EF6;&#x7684;&#x6A21;&#x5F0F;&#x3002;<br>
</li>
<li></li>
</ul>
</div>
</div>

Last Updated 2016-12-23 &#x4E94; 21:02.<br>Render by <a href="https://github.com/CodeFalling/hexo-renderer-org" target="_blank" rel="external">hexo-renderer-org</a> with <a href="http://www.gnu.org/software/emacs/" target="_blank" rel="external">Emacs</a> 25.1.1 (<a href="http://orgmode.org" target="_blank" rel="external">Org</a> mode 8.2.10)

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/12/12/0/" data-id="cix1t5gj50000w92119op7vmv" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/12/23/hello-world/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          Hello World
        
      </div>
    </a>
  
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    

  
    
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">December 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/12/23/hello-world/">Hello World</a>
          </li>
        
          <li>
            <a href="/2016/12/12/0/">Writing GNU Emacs Extensions</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 John Doe<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>